// HTML 출력 JSX

// 변수에 태그를 jsx문법으로 작성하여 할당한다!
// 주의사항 ) JSX는 최상위부모가 단 하나여야한다!
// 기본 XML문법과 동일함!
// JSX 태그 중간에 변수나 수식의 결과로 표현식으로 출력시
// 중괄호만 사용하면 된다!
// 예) <div>{변수/표현식}</div>

// 예시로 배열 데이터를 화면에 출력해보자!
// 배열 데이터 생성하기
const data = [
    { 이름: "김소영", 전화번호: "010-222-3333", 생일: "20.01.20" },
    { 이름: "전우치", 전화번호: "010-555-8888", 생일: "18.05.20" },
    { 이름: "강감찬", 전화번호: "010-666-5555", 생일: "21.02.03" },
    { 이름: "공유", 전화번호: "010-999-5555", 생일: "79.08.20" },
    { 이름: "김마리", 전화번호: "010-888-4578", 생일: "00.01.02" },
  ];
  