// DKB PJ GNB메뉴 데이터 ////

export default {
  "About tvN": "없음",
  편성표: "없음",
  채널번호: "없음",
  드라마: [
    "[예정] 별들에게 물어봐",
    "[종영] 정년이",
    "[예정] 원경",
    "[종영] 사랑은 외나무 다리에서",
    "[종영] 가석방 심사관 이한신",
  ],
  연예오락: [
    "[예정] 콩 심은 데 콩나고 밥 먹으면 밥심 난다",
    "[목] 텐트 밖은 유럽 로맨틱 이탈리아",
    "[토] 달려라 불꽃소녀",
    "[종영] 신의 레시피",
    "[월] 문과vs이과, 놀라운 증명",
    "[목] 70억의 선택",
    "[토] 웰컴투불로촌",
    "[화] 벌거벗은 세계사",
    "[금] 핀란드 셋방살이",
    "[토] 놀라운 토요일",
    "[수] 유 퀴즈 온 더 블럭",
    "[금] 프리한 닥터",
    "[일] 핸썸가이즈",
  ],
  인사이트: ["[월] 이 말을 꼭 하고 싶었어요", "[화] 김창옥쇼3"],
  동영상: "없음",
  이벤트: "없음",
  프로그램: "없음",
};
